rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
/******************************************************************************
 * platforms/esp32/source/esp32/driver/video/Esp32DriverVideoDVP.c
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026, Roku, Inc.  All rights reserved.
 *
 * ESP32 DVP (Digital Video Port) driver implementing the LTDeviceVideo /
 * ILTVideo interface.
 *
 * Architecture
 * ────────────
 * This is the master video driver for the ESP32-CAM family.  It sits at the
 * top of the stack and owns the full frame lifecycle:
 *
 *   LTDeviceVideo  →  Esp32DriverVideoDVP  →  LTDeviceImageSensor
 *                                          →  I²S0 / DMA hardware
 *
 * The driver opens LTDeviceImageSensor in LibInit to configure the sensor
 * (pixel format, frame size, power).  Frame capture is handled entirely here:
 * the I²S0 peripheral runs in 8-bit DVP camera mode, writing frames to a
 * two-buffer DMA ring.  When a frame completes the ISR fires and — from the
 * ISR context — raises an LTEvent that dispatches to all registered
 * OnVideoEvent callbacks on the subscriber's own thread.
 *
 * Frame delivery model
 * ────────────────────
 * LTDeviceVideo_VideoData is allocated per-frame (malloc'd in the ISR shim),
 * holds a pointer into the DMA buffer, and is reference-counted.  The client
 * MUST call ReleaseVideoData() after processing.
 *
 * When a slot is claimed (refCount raised to 1) it is removed from the DMA
 * descriptor ring so DMA cannot overwrite the client-held buffer.  If both
 * slots are claimed simultaneously, DMA stalls on a nullDesc sentinel and the
 * VSYNC GPIO ISR is re-armed (vsyncArmed=2).  When the client calls
 * ReleaseVideoData the slot is re-armed in place and marked pendingRearm; the
 * VSYNC ISR restarts DMA at the next frame boundary so the first byte captured
 * into the newly-free buffer is always the SOI of a fresh frame.
 *
 * Supported channels
 * ──────────────────
 *   kLTDeviceVideo_Channel_ImageHD — JPEG / RGB565 / YUV422 still frames
 *   kLTDeviceVideo_Channel_H264HD  — not supported (returns false)
 *   All SD / ISP / MdData channels  — not supported (returns false)
 *
 * DVP signal routing (AI Thinker ESP32-CAM defaults; override via config)
 * ────────────────────────────────────────────────────────────────────────
 *   PCLK=22  VSYNC=25  HREF=23
 *   D0=5  D1=18  D2=19  D3=21  D4=36  D5=39  D6=34  D7=35
 *****************************************************************************/

#include <lt/core/LTCore.h>
#include <lt/core/LTTime.h>
#include <lt/core/LTStdlib.h>
#include <lt/device/video/LTDeviceVideo.h>
#include <lt/device/imagesensor/LTDeviceImageSensor.h>
#include <lt/device/config/LTDeviceConfig.h>

#include "esp32/Esp32_Registers.h"
#include "esp32/Esp32_Clock.h"
#include "esp32/Esp32_GPIO.h"
#include "esp32/Esp32_Irq.h"


DEFINE_LTLOG_SECTION("esp32.drv.video.dvp");

/* =========================================================================
 * I²S0 register file  (base 0x3FF4F000, ESP32 TRM §12)
 * ========================================================================= */

#define I2S0_BASE           0x3FF4F000UL
#define I2S0(off)           (*(volatile u32 *)(I2S0_BASE + (off)))

/* I2S0 register offsets (i2s_struct.h field layout starting at base+0x08)
 * reserved_0=+0x00, reserved_4=+0x04, conf=+0x08, int_raw=+0x0C,
 * int_st=+0x10, int_ena=+0x14, int_clr=+0x18, timing=+0x1C,
 * fifo_conf=+0x20, rx_eof_num=+0x24, conf_single_data=+0x28,
 * conf_chan=+0x2C, out_link=+0x30, in_link=+0x34,
 * out_eof_des_addr=+0x38, in_eof_des_addr=+0x3C, out_eof_bfr_des_addr=+0x40,
 * ahb_test=+0x44, in_link_dscr=+0x48..0x50, out_link_dscr=+0x54..0x5C,
 * lc_conf=+0x60, ...
 * conf2=+0xA8, clkm_conf=+0xAC, sample_rate_conf=+0xB0 */
#define I2S_CONF_OFF         0x08
#define I2S_INT_RAW_OFF      0x0C
#define I2S_INT_ENA_OFF      0x14
#define I2S_INT_CLR_OFF      0x18
#define I2S_TIMING_OFF       0x1C
#define I2S_FIFO_CONF_OFF    0x20
#define I2S_RX_EOF_NUM_OFF   0x24
#define I2S_CONF_CHAN_OFF    0x2C
#define I2S_IN_LINK_OFF      0x34
#define I2S_IN_EOF_ADDR_OFF  0x3C
#define I2S_LC_CONF_OFF      0x60
#define I2S_CONF2_OFF        0xA8
#define I2S_CLKM_CONF_OFF    0xAC
#define I2S_SAMPLE_RATE_OFF  0xB0

/* CONF bits */
#define I2S_RX_RESET_M      (1u <<  1)
#define I2S_RX_FIFO_RESET_M (1u <<  3)
#define I2S_RX_START_M      (1u <<  5)
#define I2S_RX_SLAVE_MOD_M  (1u <<  7)
/* CONF2 bits */
#define I2S_LCD_EN_M        (1u <<  5)
#define I2S_CAMERA_EN_M     (1u <<  0)
/* FIFO_CONF bits: dscr_en[12], rx_fifo_mod[18:16], rx_fifo_mod_force_en[20] */
#define I2S_DSCR_EN_M                (1u << 12)
#define I2S_RX_FIFO_MOD_FORCE_EN_M  (1u << 20)
/* Sampling mode 3 = SM_0A00_0B00 (one byte per 32-bit DMA word) */
#define I2S_RX_FIFO_MOD_VAL         (3u << 16)
/* LC_CONF bits */
#define I2S_LC_IN_RST_M         (1u <<  0)
#define I2S_LC_AHBM_FIFO_RST_M (1u <<  2)
#define I2S_LC_AHBM_RST_M       (1u <<  3)
/* TIMING bits */
#define I2S_RX_DSYNC_SW_M   (1u << 21)
/* IN_LINK bits */
#define I2S_INLINK_ADDR_M   0x000FFFFFu
#define I2S_INLINK_STOP_M   (1u << 28)
#define I2S_INLINK_START_M  (1u << 29)
/* INT_RAW / INT_ENA bit */
#define I2S_IN_SUC_EOF_M    (1u <<  9)

/* GPIO matrix signal numbers for I²S0 RX camera mode (from soc/gpio_sig_map.h) */
#define SIG_I2S0I_DATA_IN0  140  /* I2S0I_DATA_IN0_IDX — D0–D7 → 140–147 */
#define SIG_I2S0I_WS_IN      28  /* I2S0I_WS_IN_IDX    — PCLK → WS in camera mode */
#define SIG_I2S0I_V_SYNC    191  /* I2S0I_V_SYNC_IDX   — VSYNC */
#define SIG_I2S0I_H_SYNC    190  /* I2S0I_H_SYNC_IDX   — HREF */
#define SIG_I2S0I_H_ENABLE  192  /* I2S0I_H_ENABLE_IDX — HREF (data enable) */

#define GPIO_FUNC_IN_SEL(s) (*(volatile u32 *)(0x3FF44130u + (u32)(s) * 4u))
#define GPIO_IN_USE_MATRIX  (1u << 7)

/* I²S0 external IRQ — ETS_I2S0_INTR_SOURCE=32 (from soc/soc.h) */
enum {
    kEsp32_ExternalIrq_I2S0   = 32,
    kEsp32_IrqNumber_I2S0     = 13,   /* level-1 Xtensa slot, unused by existing BSP */
    kEsp32_IrqPriority_I2S0   = 1,
    kEsp32_CPU0                = 0,
};


/* =========================================================================
 * DMA descriptor
 * ========================================================================= */

typedef struct DmaDesc {
    volatile u32             ctrl;
    volatile u8             *buf;
    volatile struct DmaDesc *next;
} DmaDesc;

/* A descriptor with OWNER_M=0 causes the DMA engine to halt when it tries to
 * load it.  Every slot's last descriptor points here when its slot is not in
 * rotation, so a ring of N free slots ends cleanly instead of wrapping. */
#define DMA_NULLDESC_INITIALIZER { 0u, NULL, NULL }

#define DMA_SIZE_M   0xFFFu
#define DMA_LEN_S    12
#define DMA_OWNER_M  (1u << 31)

/* =========================================================================
 * Pin configuration
 * ========================================================================= */

typedef struct { u8 pclk, vsync, href, d[8]; } DvpPins;

static const DvpPins kDefaultPins = {
    .pclk = 22, .vsync = 25, .href = 23,
    .d    = { 5, 18, 19, 21, 36, 39, 34, 35 },
};

/* =========================================================================
 * VideoData reference-counted wrapper
 *
 * Allocated once per frame in the ISR shim.  The DMA buffer it points into
 * is not freed — it is returned to the ring when the refcount hits zero.
 * ========================================================================= */

