rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
typedef struct {
    LTDeviceVideo_VideoData  pub;        /* must be first — clients cast to this */
    LTAtomic                 refCount;
    int                      bufIdx;     /* which ring buffer (0 or 1) */
} VideoDataWrapper;

/* =========================================================================
 * Driver state
 * ========================================================================= */

enum {
    kNumDmaDesc      = 2,      /* number of frame slots (double buffer) */
    kMaxDescBytes    = 4092,   /* max bytes per DMA descriptor (≤4095, 4-byte aligned) */
    /* JPEG DMA budget per slot.  In SM_0A00_0B00 mode 4 DMA bytes = 1 camera byte,
     * so kJpegDmaMaxBytes/4 is the camera-byte capacity per slot.
     *
     * With VSYNC synchronisation DMA always starts at the beginning of a frame,
     * so each slot needs to hold exactly one compressed JPEG.  Empirically:
     * ~6 KB for QVGA (320×240), ~3 KB for QQVGA (160×120).  32 KB (8 KB camera
     * bytes) provides comfortable headroom for any supported frame size.
     * 2 slots × 32 KB = 64 KB total. */
    kJpegDmaMaxBytes = (32768-4096)
};

typedef struct {
    /* --- sensor --- */
    LTDeviceImageSensor     *libSensor;
    LTDeviceUnit             hSensorUnit;
    ILTDriverImageSensor    *iSensor;

    /* --- channel state --- */
    bool                     enabled;                  /* Enable() called */
    bool                     streaming[kLTDeviceVideo_Channel_Count]; /* Start() called */

    /* --- LTEvent for frame delivery --- */
    LTEvent                  hFrameEvent;
    ILTEvent                *iEvent;

    /* --- DMA ring --- */
    /* Each frame slot has nDescsPerSlot chained descriptors (because each descriptor
     * can hold at most kMaxDescBytes).  Free slots are chained together; the last
     * free slot's tail points to nullDesc so DMA halts cleanly when no free slot
     * follows. */
    DmaDesc                 *descs[kNumDmaDesc];  /* malloc'd arrays, nDescsPerSlot each */
    u32                      nDescsPerSlot;
    u8                      *buf[kNumDmaDesc];
    u32                      bufSize;    /* total DMA bytes per slot (4 × raw camera bytes) */
    DmaDesc                  nullDesc;  /* OWNER=0 sentinel; DMA stalls here when ring is empty */
    bool                     dmaRunning;
    bool                     dmaStalled; /* true when all slots are held and DMA has stopped */
    LTAtomic                 pendingRearm[kNumDmaDesc]; /* 1 = slot released, needs re-arm on next VSYNC */

    /* --- per-slot frame wrappers (allocated with DMA buffers, not in ISR) --- */
    VideoDataWrapper         wrappers[kNumDmaDesc];
    u32                      sequence;

    /* --- misc --- */
    DvpPins                  pins;
    /* vsyncArmed states:
     *   0 = GPIO ISR not active
     *   1 = waiting for first VSYNC after DMA start (initial alignment)
     *   2 = waiting for VSYNC to restart stalled DMA at frame boundary */
    LTAtomic                 vsyncArmed;
} DvpDriver;

static DvpDriver *s_drv;

/* forward declarations */
static void DvpImpl_ReleaseVideoData(LTDeviceVideo_Channel, LTDeviceVideo_VideoData *);

/* =========================================================================
 * Event args: {pointer → VideoDataWrapper, u32 → channel, u32 → event}
 * ========================================================================= */

static const LTArgsDescriptor s_frameEventArgs = {
    .nNumArgs = 3,
    .argTypes = { kLTArgType_pointer, kLTArgType_u32, kLTArgType_u32 }
};

static void DispatchFrameEvent(LTEvent hEvent, void *eventProc,
                               LTArgs *args, void *eventProcClientData) {
    LT_UNUSED(hEvent);
    LTDeviceVideo_EventProc *cb = eventProc;
    VideoDataWrapper *wd = LTArgs_pointerAt(0, args);
    LTDeviceVideo_Channel ch = (LTDeviceVideo_Channel)LTArgs_u32At(1, args);
    LTDeviceVideo_Event   ev = (LTDeviceVideo_Event)LTArgs_u32At(2, args);
    /* wd is NULL for drop/fail events — pass NULL videoData to callback */
    cb(ch, ev, wd ? &wd->pub : NULL, eventProcClientData);
}

/* =========================================================================
 * Helper: route a GPIO to an I²S0 input signal via the GPIO matrix
 * ========================================================================= */

static void RouteInput(u8 gpio, u8 signal) {
    GPIO_FUNC_IN_SEL(signal) = gpio | GPIO_IN_USE_MATRIX;
    Esp32GPIO_ConfigPin(gpio, kEsp32GPIO_Direction_Input,
                        kEsp32GPIO_PullNone, kEsp32GPIO_Function_GPIO);
}

/* =========================================================================
 * DMA buffer management
 * ========================================================================= */

static bool AllocDma(u32 sz) {
    /* sz is total DMA bytes per slot (4 bytes per camera pixel byte in SM_0A00_0B00).
     * We need multiple descriptors per slot since each descriptor holds ≤ kMaxDescBytes. */
    u32 nDescs = (sz + kMaxDescBytes - 1) / kMaxDescBytes;
    if (!nDescs) nDescs = 1;

    /* Sentinel: OWNER=0 causes the DMA engine to halt when it fetches this desc. */
    DmaDesc nd = DMA_NULLDESC_INITIALIZER;
    s_drv->nullDesc = nd;

    for (int i = 0; i < kNumDmaDesc; ++i) {
        lt_free(s_drv->buf[i]);
        lt_free(s_drv->descs[i]);
        s_drv->buf[i]   = NULL;
        s_drv->descs[i] = NULL;

        s_drv->buf[i] = lt_malloc(sz);
        if (!s_drv->buf[i]) {
            LTLOG("alloc.dma", "failed to alloc %lu bytes", LT_Pu32(sz));
            return false;
        }
        s_drv->descs[i] = lt_malloc(nDescs * sizeof(DmaDesc));
        if (!s_drv->descs[i]) {
            LTLOG("alloc.dma.desc", "failed to alloc %lu descs", LT_Pu32(nDescs));
            return false;
        }
        /* Pre-populate wrapper fields that never change between frames */
        s_drv->wrappers[i].pub.address = s_drv->buf[i];
        s_drv->wrappers[i].pub.type    = kLTDeviceVideo_Frame_Jpeg;
        s_drv->wrappers[i].bufIdx      = i;
        LTAtomic_Store(&s_drv->wrappers[i].refCount, 0);
        LTAtomic_Store(&s_drv->pendingRearm[i], 0);
    }
    s_drv->bufSize       = sz;
    s_drv->nDescsPerSlot = nDescs;
    s_drv->dmaStalled    = false;
    return true;
}

