rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
static void FreeDma(void) {
    for (int i = 0; i < kNumDmaDesc; ++i) {
        lt_free(s_drv->buf[i]);
        lt_free(s_drv->descs[i]);
        s_drv->buf[i]   = NULL;
        s_drv->descs[i] = NULL;
        lt_memset(&s_drv->wrappers[i], 0, sizeof(VideoDataWrapper));
        LTAtomic_Store(&s_drv->pendingRearm[i], 0);
    }
    s_drv->bufSize       = 0;
    s_drv->nDescsPerSlot = 0;
    s_drv->dmaStalled    = false;
}

/* Arm all descriptors for slot idx in place: fill ctrl/buf fields and set the
 * tail's next to nullDesc.  Does NOT stitch this slot into the ring — call
 * RebuildRingLinks() for that.  Safe to call from any context (no DMA writes
 * to these fields while DMA is stalled or before the slot is linked in). */
static void ArmDescInPlace(int idx) {
    u32 remaining = s_drv->bufSize;
    u8 *base = s_drv->buf[idx];
    u32 n = s_drv->nDescsPerSlot;
    s_drv->descs[idx][n-1].next = &s_drv->nullDesc;
    for (u32 d = 0; d < n; ++d) {
        u32 chunk = remaining < kMaxDescBytes ? remaining : kMaxDescBytes;
        s_drv->descs[idx][d].ctrl = (chunk & DMA_SIZE_M) | ((chunk & DMA_SIZE_M) << DMA_LEN_S) | DMA_OWNER_M;
        s_drv->descs[idx][d].buf  = base;
        s_drv->descs[idx][d].next = (d + 1 < n)
            ? &s_drv->descs[idx][d + 1]
            : &s_drv->nullDesc;   /* tail → nullDesc until ring is linked */
        base      += chunk;
        remaining -= chunk;
    }
}

/* Chain all ready-to-fill (refCount==0 AND pendingRearm==0) slots into a list;
 * the last slot's tail points to nullDesc so DMA halts cleanly at the end.
 *
 * A slot with pendingRearm==1 is excluded even though refCount==0 — it has
 * been released by the client but is waiting for a VSYNC boundary before DMA
 * is allowed to write into it.
 *
 * Returns the first descriptor in the list, or NULL if no slot is ready.
 * Must be called from ISR context (or with DMA stopped). */
static DmaDesc * LT_ISR_SAFE RebuildRingLinks(void) {
    int free[kNumDmaDesc];
    int nFree = 0;
    for (int i = 0; i < kNumDmaDesc; ++i) {
        if (LTAtomic_Load(&s_drv->wrappers[i].refCount) == 0 &&
            LTAtomic_Load(&s_drv->pendingRearm[i]) == 0)
            free[nFree++] = i;
    }
    if (nFree == 0) return NULL;

    u32 n = s_drv->nDescsPerSlot;
    for (int f = 0; f < nFree - 1; ++f) {
        s_drv->descs[free[f]][n - 1].next = &s_drv->descs[free[f + 1]][0];
    }
    s_drv->descs[free[nFree - 1]][n - 1].next = &s_drv->nullDesc;

    return &s_drv->descs[free[0]][0];
}

static void BuildRing(void) {
    for (int i = 0; i < kNumDmaDesc; ++i) ArmDescInPlace(i);
    RebuildRingLinks();
}

/* =========================================================================
 * Frame byte size: derive from sensor's current config
 * ========================================================================= */

static u32 CalcFrameBytes(void) {

    LTImageSensorFrameResolution res = {0, 0};
    if (!s_drv->iSensor->GetAttribute(s_drv->hSensorUnit,
                                       kLTImageSensorAttribute_FrameResolution, &res)) return 0;
    if (!res.width || !res.height) return 0;
    LTImageSensorPixelFormat fmt = kLTImageSensorPixelFormat_JPEG;
    s_drv->iSensor->GetAttribute(s_drv->hSensorUnit,
                                  kLTImageSensorAttribute_PixelFormat, &fmt);
    u32 px = (u32)res.width * (u32)res.height;
    //LTLOG("frame.alloc", "%lu x %lu, %lu pixels, %lu bytes", LT_Pu32(res.width), LT_Pu32(res.height), LT_Pu32(px), LT_Pu32(px/4));

    /* In SM_0A00_0B00 mode the I²S0 DMA stores one camera byte per 32-bit word.
     * For JPEG the sensor emits a compressed stream of variable length; cap the
     * buffer at kJpegDmaMaxBytes so memory use is independent of resolution.
     * For raw formats each pixel produces a fixed number of camera bytes. */
    switch (fmt) {
        case kLTImageSensorPixelFormat_JPEG:
            return kJpegDmaMaxBytes;
        case kLTImageSensorPixelFormat_Grayscale:
            return px * 4u;
        default: /* RGB565, YUV422: 2 bytes per pixel */
            return px * 8u;
    }
}

/* =========================================================================
 * I²S0 hardware
 * ========================================================================= */

static void I2s0ClockEnable(bool en) {
    volatile u32 *clk = (volatile u32 *)kEsp32_RegisterDPORT_PERIP_CLK_EN;
    volatile u32 *rst = (volatile u32 *)kEsp32_RegisterDPORT_PERIP_RST_EN;
    if (en) { *clk |=  kEsp32_Clock_I2S0; *rst &= ~kEsp32_Clock_I2S0; }
    else    { *clk &= ~kEsp32_Clock_I2S0; *rst |=  kEsp32_Clock_I2S0; }
}

static void I2s0Reset(void) {
    /* Reset RX path in CONF */
    I2S0(I2S_CONF_OFF) |=  I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M;
    I2S0(I2S_CONF_OFF) &= ~(I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M);
    /* Reset DMA engine via LC_CONF */
    I2S0(I2S_LC_CONF_OFF) |=  I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M;
    I2S0(I2S_LC_CONF_OFF) &= ~(I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M);
}

static void I2s0Configure(void) {
    /* Match Espressif esp32-camera ll_cam_config exactly */
    I2S0(I2S_CONF_OFF) = I2S_RX_SLAVE_MOD_M;   /* slave, no msb_right, no mono */

    I2S0(I2S_CONF2_OFF) = I2S_LCD_EN_M | I2S_CAMERA_EN_M;

    /* Clock: CLK_EN=BIT(20), CLKM_DIV_NUM=2 (bits[7:0]) */
    I2S0(I2S_CLKM_CONF_OFF) = (1u << 20) | 2u;

    /* FIFO: dscr_en, rx_fifo_mod=SM_0A00_0B00(3), rx_fifo_mod_force_en */
    I2S0(I2S_FIFO_CONF_OFF) = I2S_DSCR_EN_M | I2S_RX_FIFO_MOD_VAL | I2S_RX_FIFO_MOD_FORCE_EN_M;

    /* Channel mode: rx_chan_mod=1 (bits[4:3]) */
    I2S0(I2S_CONF_CHAN_OFF) = (1u << 3);

    /* Sample rate: rx_bits_mod=0 (default 16; 0 means use fifo_mod) */
    I2S0(I2S_SAMPLE_RATE_OFF) = 0u;

    /* Timing: rx_dsync_sw=1 (bit 21) */
    I2S0(I2S_TIMING_OFF) = I2S_RX_DSYNC_SW_M;

    /* GPIO matrix: data pins D0-D7, PCLK→WS, VSYNC, HREF */
    for (int i = 0; i < 8; ++i)
        RouteInput(s_drv->pins.d[i], (u8)(SIG_I2S0I_DATA_IN0 + i));
    RouteInput(s_drv->pins.pclk,  SIG_I2S0I_WS_IN);
    RouteInput(s_drv->pins.vsync, SIG_I2S0I_V_SYNC);
    RouteInput(s_drv->pins.href,  SIG_I2S0I_H_SYNC);
    /* H_ENABLE: map to internal signal 0x38 (high = always enabled) per Espressif */
    GPIO_FUNC_IN_SEL(SIG_I2S0I_H_ENABLE) = 0x38u | GPIO_IN_USE_MATRIX;

