rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
}

static void I2s0StartDma(void) {
    I2S0(I2S_CONF_OFF) &= ~I2S_RX_START_M;

    I2S0(I2S_INT_CLR_OFF) = 0xFFFFFFFFu;
    I2S0(I2S_INT_ENA_OFF) = I2S_IN_SUC_EOF_M;

    I2S0(I2S_CONF_OFF) |=  I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M;
    I2S0(I2S_CONF_OFF) &= ~(I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M);
    I2S0(I2S_LC_CONF_OFF) |=  I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M;
    I2S0(I2S_LC_CONF_OFF) &= ~(I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M);

    I2S0(I2S_RX_EOF_NUM_OFF) = s_drv->bufSize / 4u;

    u32 addr = (u32)&s_drv->descs[0][0];
    I2S0(I2S_IN_LINK_OFF) = (addr & I2S_INLINK_ADDR_M) | I2S_INLINK_START_M;

    I2S0(I2S_CONF_OFF) |= I2S_RX_START_M;
}

static void I2s0StopDma(void) {
    I2S0(I2S_CONF_OFF) &= ~I2S_RX_START_M;
    I2S0(I2S_INT_ENA_OFF)  = 0;
    I2S0(I2S_IN_LINK_OFF) |= I2S_INLINK_STOP_M;
    I2S0(I2S_INT_CLR_OFF)  = 0xFFFFFFFFu;
}

/* =========================================================================
 * ISR notify path
 *
 * The ISR fills the wrapper and calls NotifyEventFromISR, which queues
 * FrameNotifyProc onto a system proxy thread.  FrameNotifyProc then calls
 * NotifyEvent — safely on a thread, not in interrupt context.
 *
 * FrameDropNotifyProc is the same pattern for the drop case.
 * ========================================================================= */

static void LT_ISR_SAFE FrameNotifyProc(void *pClientData) {
    VideoDataWrapper *wd = (VideoDataWrapper *)pClientData;
    //static int badFrames = 0;
    /* Compact: in I²S SM_0A00_0B00 camera mode the data byte from the sensor
     * lands at byte offset 2 of each 32-bit DMA word (bits[23:16] in little-endian
     * memory — confirmed by analysis of captured DMA buffers).
     * Reading from w*4+2 is always ahead of the write pointer at w, so safe. */
    u32 totalWords = wd->pub.length;   /* set by VSYNC ISR to words captured */
    u8 *raw = wd->pub.address;
    for (u32 w = 0; w < totalWords; ++w) {
        raw[w] = raw[w * 4u + 2u];
    }

    /* DMA is VSYNC-aligned: the frame always starts at raw[0] with SOI.
     * Just find the EOI to determine the actual JPEG length. */
    u32 jpegLen = 0;
    for (u32 i = 0; i + 1 < totalWords; ++i) {
        if (raw[i] == 0xFF && raw[i + 1] == 0xD9) { jpegLen = i + 2; break; }
    }

    if (jpegLen > 0 && raw[0] == 0xFF && raw[1] == 0xD8) {
        wd->pub.length = jpegLen;
        s_drv->iEvent->NotifyEvent(s_drv->hFrameEvent, &wd->pub, kLTDeviceVideo_Channel_ImageHD, kLTDeviceVideo_Event_FrameReady);
    } else {
        /* Incomplete or non-JPEG frame — release via the normal path so the
         * VSYNC-aligned re-arm logic runs correctly. */
        //LTLOG("frame.notify.bogus.jpg", "bad jpg frame %p, index %d, total %d", (void *)&wd->pub, wd->bufIdx, ++badFrames);
        DvpImpl_ReleaseVideoData(kLTDeviceVideo_Channel_ImageHD, &wd->pub);
    }
}
#if 0
static void LT_ISR_SAFE FrameDropNotifyProc(void *pClientData) {
    LT_UNUSED(pClientData);
    s_drv->iEvent->NotifyEvent(s_drv->hFrameEvent,
        (void *)NULL,
        (u32)kLTDeviceVideo_Channel_ImageHD,
        (u32)kLTDeviceVideo_Event_FrameDrop);
}
#endif
/* =========================================================================
 * VSYNC rising-edge GPIO ISR — fires at the start of each new frame.
 *
 * On the first rising VSYNC after DMA is started, the DMA ring has been
 * running freely since I2s0StartDma().  We reset the I²S0 RX path here so
 * the next byte captured is guaranteed to be the very first byte of the
 * new frame — eliminating the mid-frame alignment problem that previously
 * required the warmupDrops hack.  After one sync we detach ourselves so
 * the I²S0 EOF ISR alone drives subsequent frames.
 * ========================================================================= */

static void LT_ISR_SAFE VsyncRisingIsr(u8 nPin, bool bPinHigh, void *pClientData) {
    LT_UNUSED(nPin); LT_UNUSED(bPinHigh); LT_UNUSED(pClientData);
    if (!s_drv || !s_drv->dmaRunning) return;

    u32 state = LTAtomic_Load(&s_drv->vsyncArmed);
    if (state == 0) return;

    if (state == 1) {
        /* Initial alignment: first VSYNC after DMA start.  After this we
         * detach the ISR — it will be re-attached only if DMA stalls. */
        LTAtomic_Store(&s_drv->vsyncArmed, 0);
        Esp32GPIO_DetachISR(s_drv->pins.vsync);

        I2S0(I2S_CONF_OFF) &= ~I2S_RX_START_M;
        I2S0(I2S_CONF_OFF)    |=  I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M;
        I2S0(I2S_CONF_OFF)    &= ~(I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M);
        I2S0(I2S_LC_CONF_OFF) |=  I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M;
        I2S0(I2S_LC_CONF_OFF) &= ~(I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M);

        LTAtomic_Store(&s_drv->wrappers[0].refCount, 0);
        LTAtomic_Store(&s_drv->wrappers[1].refCount, 0);
        for (int i = 0; i < kNumDmaDesc; ++i) ArmDescInPlace(i);
        DmaDesc *head = RebuildRingLinks();

        u32 addr = (u32)head;
        I2S0(I2S_IN_LINK_OFF) = (addr & I2S_INLINK_ADDR_M) | I2S_INLINK_START_M;
        I2S0(I2S_CONF_OFF)    |= I2S_RX_START_M;
        return;
    }

    /* state == 2: DMA stalled because all slots were held by the client.
     * Re-arm whichever slots have been released (pendingRearm set), rebuild
     * the ring, and restart DMA at this frame boundary. */
    LTAtomic_Store(&s_drv->vsyncArmed, 0);
    Esp32GPIO_DetachISR(s_drv->pins.vsync);

    bool anyFree = false;
    for (int i = 0; i < kNumDmaDesc; ++i) {
        if (LTAtomic_CompareAndExchange(&s_drv->pendingRearm[i], 1, 0)) {
            /* Release the hold we kept so DMA wouldn't overwrite the buffer */
            LTAtomic_Store(&s_drv->wrappers[i].refCount, 0);
            ArmDescInPlace(i);
            anyFree = true;
        }
    }
    if (!anyFree) return;   /* shouldn't happen, but be safe */

    DmaDesc *head = RebuildRingLinks();
    if (!head) return;      /* still no free slot somehow */

    I2S0(I2S_CONF_OFF) &= ~I2S_RX_START_M;
    I2S0(I2S_CONF_OFF)    |=  I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M;
    I2S0(I2S_CONF_OFF)    &= ~(I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M);
    I2S0(I2S_LC_CONF_OFF) |=  I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M;
    I2S0(I2S_LC_CONF_OFF) &= ~(I2S_LC_IN_RST_M | I2S_LC_AHBM_FIFO_RST_M | I2S_LC_AHBM_RST_M);

    u32 addr = (u32)head;
    I2S0(I2S_IN_LINK_OFF) = (addr & I2S_INLINK_ADDR_M) | I2S_INLINK_START_M;
    I2S0(I2S_CONF_OFF)    |= I2S_RX_START_M;
    s_drv->dmaStalled = false;
}

/* =========================================================================
 * I²S0 EOF ISR — fires on I²S0 in-DMA-EOF at Xtensa level 1
 * ========================================================================= */

static void LT_ISR_SAFE I2s0FrameIsr(void) {
    u32 status = I2S0(I2S_INT_RAW_OFF);
    I2S0(I2S_INT_CLR_OFF) = status;

    if (!(status & I2S_IN_SUC_EOF_M) || !s_drv || !s_drv->dmaRunning) return;

    /* Identify which slot completed */
    u32 eofAddr = I2S0(I2S_IN_EOF_ADDR_OFF);
    int idx = -1;
    for (int i = 0; i < kNumDmaDesc && idx < 0; ++i) {
        for (u32 d = 0; d < s_drv->nDescsPerSlot; ++d) {
            if (eofAddr == (u32)&s_drv->descs[i][d]) { idx = i; break; }
        }
    }
    if (idx < 0) return;

