rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
    VideoDataWrapper *wd = &s_drv->wrappers[idx];

    /* If the client still holds this slot (shouldn't happen because we remove
     * claimed slots from the ring, but guard defensively), drop the frame. */
    if (LTAtomic_Load(&wd->refCount) != 0) {
        LTLOG("isr.frame.drop", "dma clobbering frame %p, index %d", (void *)&wd->pub, idx);
        return;
    }

    u32 totalWords = s_drv->bufSize / 4u;
    wd->pub.length   = totalWords;
    wd->pub.time     = LT_GetCore()->GetKernelTime();
    wd->pub.sequence = s_drv->sequence++;
    LTAtomic_Store(&wd->refCount, 1);

    /* This slot is now claimed.  Rebuild the ring so it no longer appears in
     * the DMA descriptor chain — DMA will proceed only through free slots.
     * If no free slot remains the ring terminates at nullDesc and DMA stalls;
     * we set vsyncArmed=2 and re-attach the VSYNC ISR to restart at the next
     * frame boundary once the client releases a slot. */
    DmaDesc *head = RebuildRingLinks();
    if (!head) {
        s_drv->dmaStalled = true;
        LTAtomic_Store(&s_drv->vsyncArmed, 2);
        Esp32GPIO_AttachISR(s_drv->pins.vsync, kEsp32GPIO_Trigger_Rising,
                            VsyncRisingIsr, NULL);
    }

    //LTLOG("isr.frame.acquiring", "acquiring frame %p, index %d", (void *)&wd->pub, idx);
    s_drv->iEvent->NotifyEventFromISR(FrameNotifyProc, wd);
}

/* =========================================================================
 * ILTVideo implementation
 * ========================================================================= */

static bool DvpImpl_Enable(LTDeviceVideo_Source source) {
    if (source != kLTDeviceVideo_Source_0) return false;
    if (s_drv->enabled) return true;
    s_drv->libSensor->PowerOn(s_drv->hSensorUnit);
    s_drv->enabled = true;
    //LTLOG("dvp.enable", NULL);
    return true;
}

static void DvpImpl_Disable(LTDeviceVideo_Source source) {
    LT_UNUSED(source);
    if (!s_drv->enabled) return;
    s_drv->libSensor->PowerOff(s_drv->hSensorUnit);
    s_drv->enabled = false;
    //LTLOG("dvp.disable", NULL);
}

static bool DvpImpl_Start(LTDeviceVideo_Channel channel) {
    if (channel != kLTDeviceVideo_Channel_ImageHD) return false;
    if (s_drv->streaming[channel]) return true;
    if (!s_drv->enabled) { LTLOG_YELLOWALERT("dvp.start.noen", NULL); return false; }

    u32 frameBytes = CalcFrameBytes();
    if (!frameBytes) { LTLOG_YELLOWALERT("dvp.start.sz", NULL); return false; }

    if (!AllocDma(frameBytes)) { LTLOG_YELLOWALERT("dvp.start.oom", "failed to allocate %lu dma buffer bytes", LT_Pu32(frameBytes)); return false; }
    BuildRing();

    I2s0ClockEnable(true);
    I2s0Reset();
    I2s0Configure();

    Esp32MapExternalToCPUIrq(kEsp32_CPU0,
        (Esp32_ExternalIrq)kEsp32_ExternalIrq_I2S0,
        (Esp32_IrqNumber)kEsp32_IrqNumber_I2S0);
    LT_GetCore()->SetInterruptVector(kEsp32_IrqNumber_I2S0, I2s0FrameIsr,
                                     kEsp32_IrqPriority_I2S0);

    /* Start DMA, then wait for the first VSYNC rising edge before delivering
     * any frames.  VsyncRisingIsr resets the I²S0 RX path on that edge so
     * DMA is guaranteed to start at byte 0 of a new frame. */
    //LTLOG("dvp.vsync.v", "2");   /* increment this each time you rebuild to confirm new code is running */
    LTAtomic_Store(&s_drv->vsyncArmed, 1);
    s_drv->dmaRunning = true;
    s_drv->streaming[channel] = true;
    I2s0StartDma();
    Esp32GPIO_AttachISR(s_drv->pins.vsync, kEsp32GPIO_Trigger_Rising, VsyncRisingIsr, NULL);
    //LTLOG("dvp.start", "ch=%ld %lu bytes/frame", channel, LT_Pu32(frameBytes));
    return true;
}

static void DvpImpl_Stop(LTDeviceVideo_Channel channel) {
    if (channel != kLTDeviceVideo_Channel_ImageHD) return;
    if (!s_drv->streaming[channel]) return;

    /* Detach VSYNC ISR if it is active (state 1 = initial alignment,
     * state 2 = DMA stall restart) */
    u32 armed = LTAtomic_Load(&s_drv->vsyncArmed);
    if (armed != 0) {
        LTAtomic_Store(&s_drv->vsyncArmed, 0);
        Esp32GPIO_DetachISR(s_drv->pins.vsync);
    }

    s_drv->dmaRunning = false;
    s_drv->streaming[channel] = false;
    I2s0StopDma();
    LT_GetCore()->SetInterruptVector(kEsp32_IrqNumber_I2S0, NULL,
                                     kEsp32_IrqPriority_I2S0);
    I2s0ClockEnable(false);
    FreeDma();
    //LTLOG("dvp.stop", "ch=%ld", channel);
}

static void DvpImpl_Pause(void) {
    if (s_drv->dmaRunning) {
        I2S0(I2S_CONF_OFF) &= ~I2S_RX_START_M;
    }
}

static void DvpImpl_Resume(void) {
    if (s_drv->dmaRunning) {
        I2S0(I2S_CONF_OFF) |= I2S_RX_START_M;
    }
}

static void DvpImpl_OnVideoEvent(LTDeviceVideo_Channel channel,
                                  LTDeviceVideo_EventProc *eventProc,
                                  void *clientData) {
    if (channel != kLTDeviceVideo_Channel_ImageHD) return;
    s_drv->iEvent->RegisterForEvent(s_drv->hFrameEvent, eventProc, NULL, clientData, false);
}

static void DvpImpl_NoVideoEvent(LTDeviceVideo_Channel channel,
                                  LTDeviceVideo_EventProc *eventProc) {
    if (channel != kLTDeviceVideo_Channel_ImageHD) return;
    s_drv->iEvent->UnregisterFromEvent(s_drv->hFrameEvent, eventProc);
}

static void DvpImpl_ReleaseVideoData(LTDeviceVideo_Channel channel,
                                      LTDeviceVideo_VideoData *videoData) {
    LT_UNUSED(channel);
    if (!videoData) return;
    VideoDataWrapper *wd = (VideoDataWrapper *)videoData;

    int idx = wd->bufIdx;
    if (idx < 0 || idx >= kNumDmaDesc) return;

    /* Prepare the descriptors while the slot is still marked held, so the
     * ISR's RebuildRingLinks cannot race and include a half-ready slot. */
    ArmDescInPlace(idx);

     //LTLOG("release.video.data", "releasing frame %p, index %d", (void *)&wd->pub, idx);
    /* Mark pending-rearm BEFORE clearing refCount.  RebuildRingLinks excludes
     * slots with pendingRearm==1, so even if refCount drops to 0 between the
     * two stores the ISR will not link this slot into the active ring until
     * the VSYNC boundary. */
    LTAtomic_Store(&s_drv->pendingRearm[idx], 1);
    LTAtomic_FetchSubtract(&wd->refCount, 1);

    /* If DMA stalled because all slots were held, the VSYNC ISR is already
     * armed (vsyncArmed==2).  If for some reason it isn't, arm it now. */
    if (s_drv->dmaStalled) {
        if (LTAtomic_CompareAndExchange(&s_drv->vsyncArmed, 0, 2)) {
            Esp32GPIO_AttachISR(s_drv->pins.vsync, kEsp32GPIO_Trigger_Rising,
                                VsyncRisingIsr, NULL);
        }
    }
}

static bool DvpImpl_Capture(LTDeviceVideo_Channel channel,
                             LTDeviceVideo_FrameType type) {
    LT_UNUSED(type);
    return channel == kLTDeviceVideo_Channel_ImageHD && s_drv->streaming[channel];
}

static s32 DvpImpl_CaptureSingle(LTDeviceVideo_Channel channel,
                                   LTDeviceVideo_FrameType type,
                                   u8 *destBuf, u32 destMaxLen) {
    LT_UNUSED(type);
    if (channel != kLTDeviceVideo_Channel_ImageHD) return -1;
    if (!s_drv->streaming[channel]) return -1;

