rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
    s32 result = -1;

    /* Poll the pre-allocated wrappers until the ISR fills one */
    ILTThread *iThread = lt_getlibraryinterface(ILTThread, LT_GetCore());
    for (int attempts = 0; attempts < 200; ++attempts) {
        for (int i = 0; i < kNumDmaDesc; ++i) {
            VideoDataWrapper *wd = &s_drv->wrappers[i];
            /* Try to take a reference on a slot the ISR just filled */
            if (LTAtomic_FetchAdd(&wd->refCount, 1) >= 1) {
                /* Successfully claimed a frame in this slot */
                u32 len = wd->pub.length;
                if (len > 0 && len <= destMaxLen) {
                    lt_memcpy(destBuf, wd->pub.address, len);
                    result = (s32)len;
                } else {
                    result = -1;
                }
                DvpImpl_ReleaseVideoData(channel, &wd->pub);
                return result;
            }
            /* Not filled yet — undo the increment we just did */
            LTAtomic_FetchSubtract(&wd->refCount, 1);
        }
        iThread->Sleep(LTTime_Milliseconds(5));
    }
    return -1;
}

static s32 DvpImpl_CaptureCrop(LTDeviceVideo_Channel channel,
                                 LTDeviceVideo_FrameType type,
                                 u8 *destBuf, u32 cropW, u32 cropH,
                                 u32 centerX, u32 centerY) {
    /* DVP delivers full frames; crop is not supported in hardware */
    LT_UNUSED(cropW); LT_UNUSED(cropH); LT_UNUSED(centerX); LT_UNUSED(centerY);
    return DvpImpl_CaptureSingle(channel, type, destBuf, cropW * cropH * 2);
}

static void DvpImpl_RequestIdrFrame(LTDeviceVideo_Channel channel) {
    LT_UNUSED(channel);
    /* OV3660 DVP has no H.264 encoder — no-op */
}

static void DvpImpl_Poll(LTDeviceVideo_Channel channel) {
    LT_UNUSED(channel);
    /* Interrupt-driven; polling not required */
}

static bool DvpImpl_GetParam(LTDeviceVideo_Param param, void *value) {
    switch (param) {
        case kLTDeviceVideo_Param_ResolutionHD: {
            LTImageSensorFrameResolution fsz = {0, 0};
            if (!s_drv->iSensor->GetAttribute(s_drv->hSensorUnit,
                                               kLTImageSensorAttribute_FrameResolution, &fsz))
                return false;
            LTDeviceVideo_Resolution *res = value;
            res->width  = fsz.width;
            res->height = fsz.height;
            return true;
        }
        case kLTDeviceVideo_Param_Status:
            LTLOG("dvp.status", "enabled=%d streaming=%d dma=%d",
                s_drv->enabled,
                s_drv->streaming[kLTDeviceVideo_Channel_ImageHD],
                s_drv->dmaRunning);
            return true;
        default:
            return false;
    }
}

static bool DvpImpl_SetParam(LTDeviceVideo_Param param, const void *value) {
    switch (param) {
        case kLTDeviceVideo_Param_FlipVertical: {
            u8 flips[2] = { 1, 0 };
            LTImageSensorAttributeParams p = { .in = flips, .inLen = 2 };
            return s_drv->iSensor->SetAttribute(s_drv->hSensorUnit,
                kLTImageSensorAttribute_FlipVerticalHorizontal, &p);
        }
        case kLTDeviceVideo_Param_FlipHorizontal: {
            u8 flips[2] = { 0, 1 };
            LTImageSensorAttributeParams p = { .in = flips, .inLen = 2 };
            return s_drv->iSensor->SetAttribute(s_drv->hSensorUnit,
                kLTImageSensorAttribute_FlipVerticalHorizontal, &p);
        }
        case kLTDeviceVideo_Param_AutoExposure: {
            bool en = *(const bool *)value;
            return s_drv->iSensor->SetAttribute(s_drv->hSensorUnit,
                kLTImageSensorAttribute_AutoExposureControl, &en);
        }
        case kLTDeviceVideo_Param_Framerate: {
            u32 fps = *(const u32 *)value;
            return s_drv->iSensor->SetAttribute(s_drv->hSensorUnit,
                kLTImageSensorAttribute_FrameRate, &fps);
        }
        case kLTDeviceVideo_Param_Brightness: {
            int level = *(const int *)value;
            return s_drv->iSensor->SetAttribute(s_drv->hSensorUnit,
                kLTImageSensorAttribute_Brightness, &level);
        }
        default:
            return false;
    }
}

/* =========================================================================
 * Library init / fini
 * ========================================================================= */

static void LoadPinConfig(void) {
    s_drv->pins = kDefaultPins;
    LTDeviceConfig *cfg = lt_openlibrary(LTDeviceConfig);
    if (!cfg) return;
    u32 sec = cfg->GetDriverSection("LTDeviceVideo", "Esp32DriverVideoDVP");
    if (sec) {
        #define RD(key, field) { u32 _v = cfg->ReadInteger(sec, key); if (_v) (field) = (u8)_v; }
        RD("pclk",  s_drv->pins.pclk);  RD("vsync", s_drv->pins.vsync);
        RD("href",  s_drv->pins.href);
        RD("d0", s_drv->pins.d[0]); RD("d1", s_drv->pins.d[1]);
        RD("d2", s_drv->pins.d[2]); RD("d3", s_drv->pins.d[3]);
        RD("d4", s_drv->pins.d[4]); RD("d5", s_drv->pins.d[5]);
        RD("d6", s_drv->pins.d[6]); RD("d7", s_drv->pins.d[7]);
        #undef RD
    }
    lt_closelibrary(cfg);
}

static void Shutdown(void) {
    if (!s_drv) return;
    for (int ch = 0; ch < kLTDeviceVideo_Channel_Count; ++ch)
        if (s_drv->streaming[ch]) DvpImpl_Stop((LTDeviceVideo_Channel)ch);
    if (s_drv->enabled) DvpImpl_Disable(kLTDeviceVideo_Source_0);
    lt_destroyhandle(s_drv->hFrameEvent); s_drv->hFrameEvent = 0;
    lt_destroyhandle(s_drv->hSensorUnit); s_drv->hSensorUnit = 0;
    lt_closelibrary(s_drv->libSensor);    s_drv->libSensor = NULL;
    lt_free(s_drv);
    s_drv = NULL;
}

static bool Esp32DriverVideoDVPImpl_LibInit(void) {
    s_drv = lt_malloc(sizeof(DvpDriver));
    if (!s_drv) return false;
    lt_memset(s_drv, 0, sizeof(DvpDriver));

    VideoDataWrapper *wd = &s_drv->wrappers[0];
    LT_ASSERT((void *)wd == (void *)&wd->pub);

    /* Open image sensor */
    if (!(s_drv->libSensor = lt_openlibrary(LTDeviceImageSensor))) {
        LTLOG("dvp.init.sensor", NULL); goto err;
    }
    if (!(s_drv->hSensorUnit = s_drv->libSensor->CreateDeviceUnitHandle(0))) {
        LTLOG("dvp.init.unit", NULL); goto err;
    }
    if (!(s_drv->iSensor = lt_gethandleinterface(ILTDriverImageSensor, s_drv->hSensorUnit))) {
        LTLOG("dvp.init.intf", NULL); goto err;
    }

    /* Create the frame event */
    s_drv->iEvent = lt_getlibraryinterface(ILTEvent, LT_GetCore());
    if (!s_drv->iEvent) { LTLOG("dvp.init.event.intf", NULL); goto err; }

    s_drv->hFrameEvent = LT_GetCore()->CreateEvent(&s_frameEventArgs, DispatchFrameEvent, NULL, NULL, NULL);
    if (!s_drv->hFrameEvent) { LTLOG("dvp.init.event", NULL); goto err; }

    LoadPinConfig();

