rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/video/dvp/Esp32DriverVideoDVP.c
    //LTLOG("dvp.init", "ESP32 DVP video driver ready (pclk=%lu vsync=%lu href=%lu)",
    //    LT_Pu32(s_drv->pins.pclk), LT_Pu32(s_drv->pins.vsync), LT_Pu32(s_drv->pins.href));
    return true;

err:
    Shutdown();
    return false;
}

static void Esp32DriverVideoDVPImpl_LibFini(void) {
    Shutdown();
}

/* =========================================================================
 * define_LTDEVICE_DRIVER_IMPLEMENTATION + ILTVideo interface binding
 * ========================================================================= */

define_LTDEVICE_DRIVER_IMPLEMENTATION(LTDeviceVideo, Esp32DriverVideoDVP);

static u32 Esp32DriverVideoDVPImpl_GetNumDeviceUnits(void) { return 1; }

static const ILTVideo s_ILTVideo;   /* defined below by define_LTLIBRARY_INTERFACE */

static LTDeviceUnit Esp32DriverVideoDVPImpl_CreateDeviceUnitHandle(u32 n) {
    LT_UNUSED(n);
    /* Single unit — the handle carries the ILTVideo interface with no private data */
    return LT_GetCore()->CreateHandle((LTInterface *)&s_ILTVideo, 1);
}

define_LTLIBRARY_INTERFACE(ILTVideo) {
    .Enable           = DvpImpl_Enable,
    .Disable          = DvpImpl_Disable,
    .Start            = DvpImpl_Start,
    .Stop             = DvpImpl_Stop,
    .Pause            = DvpImpl_Pause,
    .Resume           = DvpImpl_Resume,
    .OnVideoEvent     = DvpImpl_OnVideoEvent,
    .NoVideoEvent     = DvpImpl_NoVideoEvent,
    .ReleaseVideoData = DvpImpl_ReleaseVideoData,
    .Capture          = DvpImpl_Capture,
    .CaptureSingle    = DvpImpl_CaptureSingle,
    .CaptureCrop      = DvpImpl_CaptureCrop,
    .RequestIdrFrame  = DvpImpl_RequestIdrFrame,
    .Poll             = DvpImpl_Poll,
    .GetParam         = DvpImpl_GetParam,
    .SetParam         = DvpImpl_SetParam,
} LTLIBRARY_DEFINITION;

LTLIBRARY_EXPORT_INTERFACES(Esp32DriverVideoDVP, (ILTVideo))

/******************************************************************************
 *  LOG
 ******************************************************************************
 *  31-May-26   created
 */
